tooling/artillery/scenarios/basic-scenario.yml
config:
  plugins:
    publish-metrics:
      - type: influxdb-statsd
        prefix: artillery.
        host: 127.0.0.1
        port: 8125
    expect: {}
  target: 'http://localhost:8092/api/'
  phases:
    - duration: 10
      arrivalRate: 10
scenarios:
  - flow:
    - get:
        url: "/v1/example"
        capture:
          - json: "$.status"
            as: status
        expect:
          - statusCode: 200
          - equals:
            - "success"
            - "{{status}}"
  - flow:
    - get:
        url: "/v2/example"
        capture:
          - json: "$.status"
            as: status
        expect:
          - statusCode: 200
          - equals:
            - "success"
            - "{{status}}"